{
  "_name_or_path": "clip-vit-large-patch16-improved/",
  "architectures": ["CLIPModel"],
  "projection_dim": 768,
  "logit_scale_init_value": 2.6592,
  "model_type": "clip",
  "text_config": {
    "vocab_size": 50000,
    "hidden_size": 768,
    "intermediate_size": 2048,
    "num_hidden_layers": 12,
    "num_attention_heads": 12,
    "max_position_embeddings": 80,
    "hidden_act": "gelu",
    "layer_norm_eps": 1e-5,
    "dropout": 0.0,
    "attention_dropout": 0.0,
    "initializer_range": 0.02,
    "use_glu": true,
    "ln_type": "normformer",
    "use_bias": false,
    "force_scale": false
  },
  "vision_config": {
    "hidden_size": 1024,
    "intermediate_size": 2688,
    "num_hidden_layers": 24,
    "num_attention_heads": 16,
    "num_channels": 3,
    "image_size": 256,
    "patch_size": 16,
    "hidden_act": "gelu",
    "layer_norm_eps": 1e-5,
    "dropout": 0.0,
    "attention_dropout": 0.0,
    "initializer_range": 0.02,
    "use_glu": true,
    "ln_type": "normformer",
    "use_bias": false,
    "force_scale": false
  }
}
