{
  "_name_or_path": "clip-vit-base-patch16/",
  "architectures": ["CLIPModel"],
  "projection_dim": 512,
  "logit_scale_init_value": 2.6592,
  "model_type": "clip",
  "text_config": {
    "vocab_size": 50000,
    "hidden_size": 512,
    "intermediate_size": 2048,
    "num_hidden_layers": 12,
    "num_attention_heads": 8,
    "max_position_embeddings": 80,
    "hidden_act": "quick_gelu",
    "layer_norm_eps": 1e-5,
    "dropout": 0.0,
    "attention_dropout": 0.0,
    "initializer_range": 0.02
  },
  "vision_config": {
    "hidden_size": 768,
    "intermediate_size": 3072,
    "num_hidden_layers": 12,
    "num_attention_heads": 12,
    "num_channels": 3,
    "image_size": 256,
    "patch_size": 16,
    "hidden_act": "quick_gelu",
    "layer_norm_eps": 1e-5,
    "dropout": 0.0,
    "attention_dropout": 0.0,
    "initializer_range": 0.02
  }
}
